Repository: CofficLab/Lumi
Catalog: Plugins/EditorSwiftPlugin/Sources/Localizable.xcstrings
Source language: en
Languages: zh_hans, zh_hk

source: This code action has no edit or command
zh_hans: 此代码操作没有编辑或命令
zh_hk: 此代碼操作沒有編輯或命令

source: This file type is not supported by Inline Preview yet.
zh_hans: 内嵌预览暂不支持此文件类型。
zh_hk: 內嵌預覽暫不支援此檔案類型。

source: This item will be moved to the Trash.
zh_hans: 该项目将被移到废纸篓。
zh_hk: 該項目將被移到垃圾桶。

source: Toggle Line Comment
zh_hans: 切换行注释
zh_hk: 切換行註釋

source: Transpose Characters
zh_hans: 交换字符
zh_hk: 交換字符

source: Trigger Completion
zh_hans: 触发补全
zh_hk: 觸發補全

source: Trigger Parameter Hints
zh_hans: 触发参数提示
zh_hk: 觸發參數提示

source: Trim Trailing Whitespace
zh_hans: 去除尾部空白
zh_hk: 去除尾部空白

source: truncated
zh_hans: 已截断
zh_hk: 已截斷

source: Unable to Open File
zh_hans: 无法打开文件
zh_hk: 無法開啟檔案

source: Unavailable
zh_hans: 不可用
zh_hk: 不可用

source: Unavailable: %@
zh_hans: 不可用：%@
zh_hk: 不可用：%@

source: Undetermined
zh_hans: 未确定
zh_hk: 未確定

source: Undo
zh_hans: 撤销
zh_hk: 撤銷

source: Unfold All
zh_hans: 全部展开
zh_hk: 全部展開

source: Unfold Current Block
zh_hans: 展开当前代码块
zh_hk: 展開當前代碼塊

source: Unknown
zh_hans: 未知
zh_hk: 未知

source: Unpin Tab
zh_hans: 取消固定标签页
zh_hk: 取消固定標籤頁

source: Unsupported editor plugin action
zh_hans: 不支持的编辑器插件操作
zh_hk: 不支持的編輯器插件操作

source: Unsupported File
zh_hans: 不支持的文件
zh_hk: 不支持的文件

source: Unsupported plist format
zh_hans: 不支持的 plist 格式
zh_hk: 不支援的 plist 格式

source: Use Lumi Version
zh_hans: 使用 Lumi 版本
zh_hk: 使用 Lumi 版本

source: Use Project Version
zh_hans: 使用项目版本
zh_hk: 使用項目版本

source: Use Regular Expression
zh_hans: 使用正则表达式
zh_hk: 使用正則表達式

source: Visible L%lld-%lld · Render L%lld-%lld
zh_hans: 可见 L%lld-%lld · 渲染 L%lld-%lld
zh_hk: 可見 L%lld-%lld · 渲染 L%lld-%lld

source: warming
zh_hans: 预热中
zh_hk: 預熱中

source: Whole Word
zh_hans: 全字匹配
zh_hk: 全字匹配

source: Workspace
zh_hans: 工作区
zh_hk: 工作區

source: Workspace Symbols
zh_hans: 工作区符号
zh_hk: 工作區符號

source: Workspace Symbols (%lld)
zh_hans: 工作区符号（%lld）
zh_hk: 工作區符號（%lld）

source: Workspace symbols not available
zh_hans: 工作区符号不可用
zh_hk: 工作區符號不可用

source: Workspace Symbols panel in the editor bottom area
zh_hans: 编辑器底部的符号面板
zh_hk: 編輯器底部的符號面板

source: Xcode Build Context
zh_hans: Xcode 构建上下文
zh_hk: Xcode 構建上下文

source: Xcode Context
zh_hans: Xcode 上下文
zh_hk: Xcode 上下文

source: Xcode Project Editor
zh_hans: Xcode 项目编辑器
zh_hk: Xcode 項目編輯器

source: 工作区符号当前不可用
zh_hk: 工作区符号目前不可用

source: 搜索符号...
zh_hk: 搜尋符号...

source: Swift Editor
zh_hans: Swift 编辑器
zh_hk: Swift 編輯器

source: Provides Swift language support, Xcode project identity, build context, and sourcekit-lsp integration.
zh_hans: 提供 Swift 语言支持、Xcode 项目标识、构建上下文与 sourcekit-lsp 集成。
zh_hk: 提供 Swift 語言支援、Xcode 專案識別、建置上下文與 sourcekit-lsp 整合。

source: Provides Swift primitive type completion suggestions.
zh_hans: 提供 Swift 基础类型补全建议。
zh_hk: 提供 Swift 基礎類型補全建議。

source: Swift Primitive Types
zh_hans: Swift 基础类型
zh_hk: Swift 基礎類型

source: Provides selection-based Swift code actions.
zh_hans: 提供基于选区的 Swift 代码操作。
zh_hk: 提供基於選區的 Swift 代碼操作。

source: Swift Selection Code Actions
zh_hans: Swift 选区代码操作
zh_hk: Swift 選區代碼操作

source: Wrap Selection in #if DEBUG
zh_hans: 使用 #if DEBUG 包裹选区
zh_hk: 使用 #if DEBUG 包裹選區

source: Wrap Selection with print(...)
zh_hans: 使用 print(...) 包裹选区
zh_hk: 使用 print(...) 包裹選區

source: Shows inline hover documentation for common Swift keywords.
zh_hans: 为常见 Swift 关键字显示内联悬停文档。
zh_hk: 為常見 Swift 關鍵字顯示內聯懸停文檔。

source: Editor Swift Keyword Hover
zh_hans: 编辑器 Swift 关键字悬停
zh_hk: 編輯器 Swift 關鍵字懸停
